        ## Задание 5
        ** Ответ**: значение 33. в метод changeValue мы передаем значение переменной 33, а не заново
        созданную переменную.
        ## Задание 6
        ** Ответ**: значение 33. в методе changeValue мы создаем новый объект со значением 22, а значение сылочной переменной Integer value не изменилось.
        ## Задание 7
        ** Ответ**: значение [3, 4]. Ссылаемся на массив {1,2}.
        ## Задание 8
        ** Ответ**: значение 99. поменяли значение [0]массива.
        ## Задание 9
        ** Ответ**: Person{name='Lyapis', surName='Trubetskoy'}. В методе changePerson создали новый объект.
        ## Задание 10
        ** Ответ**: Person{name='Ilya', surName='Lagutenko'} Перезаписали параметры объекта.

